Tekla Open API Reference for Tekla Structures 2025
SectionMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.SectionMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
SectionName
Returns the section name property element type.
SourceDrawingName
Returns the source drawing name property element type.
SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.SectionMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace